#include <stdio.h>
int num;
char a[11],res;
int main()
{
	scanf("%c-%c%c%c-%c%c%c%c%c-%c",&a[1],&a[2],&a[3],&a[4],&a[5],&a[6],&a[7],&a[8],&a[9],&a[10]);  //字符输入各个数字存入字符型数组
	num=((a[1]-48)*1+(a[2]-48)*2+(a[3]-48)*3+(a[4]-48)*4+(a[5]-48)*5+(a[6]-48)*6+(a[7]-48)*7+(a[8]-48)*8+(a[9]-48)*9)%11;  //字符型转为整数型时由于每个数字对应ASCII值与数字本身值不相等，数字大小会发生变化，则计算时减去码值变化差值48
	if(num==10)
	{
		res=88;  //因为若计算结果是10时输出结果为X，则需要用条件判断是否需要输出X
	}
	else
	{
		res=num+48;  //最后判断是否正确时还要转换为原来的码值。

	}
	if(res==a[10])
	{
		printf("Right\n");
	}
	else
	{	
		printf("%c-%c%c%c-%c%c%c%c%c-%c\n",a[1],a[2],a[3],a[4],a[5],a[6],a[7],a[8],a[9],res);
	}
	return 0;
}